/*                                 Caching in Flutter

ده بيستخدم لتخزين الداتا محلي الداتا عشان المستخدم لما يحب يرجع ليها يقدر يرجع للداتا من غير الاتصال بالانترنت 

التخزين بيتم اما في الرامات وده بيبقا تخزين مؤقت اثناء تشغيل البرنامج واول ما يتقفل الداتا تتمسح 

او التخزين  على جهاز العميل وهنا بتكون الداتا موجوده حتى لو البرنامج اتقفل 

والطريقه دي بنلجألها لو عايزين الofflinr mode مجرد نجيب الداتا  من السرفر او من ع النت وعايزين نرجعلها في اي وقت 

فلاتر في تخزين الصور  الي من خلال image.network  وده بيتم تلقائي



*/