/*                                   State Management in Flutter

state بتنقسم لحالتين 
1- StatelessWidget    
   دي من خلالها مش هقدر اعمل اي تغير في ال ui للتطبيق زي مثلا لما اضغط على زرار يتغير لونه 


2- StatefulWidget 
    لو في زرار هيتيغر لونه عند الضغط بيتم من خلالها بسبب وجود setState 


State Management in Flutter 
 من خلالها ببيتم بناء الواجهه في حاله وجود تغيير زي ان لما اضغط على زرار هيتغير لونه وده بيتم من خلال 

 1- StatefulWidget
   هنا من خلال ال setState بيتم اعاده بناء الواجهه ودي سهله جدا في حاله التطبيقات الصغيره 

 2- provider
   دي عباره عن مكتبه داخل فلاتر بقدر استخدمها من pub.dev ومن خلالها بيتم الفصل بين اللوجيك وال UI

 3- Bloc
  دي مكتبه برده و بتعتمد على streams 
  وبيتم الفصل بين اللوجيك بيبقا داخل البلوك والUI ومناسب للمشاريع الكبيره 


 4-get x
   دي مكتبه داخل  فلاتر برده من خلالها بيتم الفصل بين اللوجيك والUI 

















*/ 